Repository: python/pootle-python-org-backup
Catalog: tmxes/fr/faq.tmx
Source language: en
Languages: fr

source: You could define an alias for the base class, assign the real base class to it before your class definition, and use the alias throughout your class. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
fr: Vous pouvez définir un alias pour la classe de base, lui attribuer la classe de base réelle avant la définition de classe, et utiliser l'alias au long de votre classe. Ensuite, tout ce que vous devez changer est la valeur attribuée à l'alias. Incidemment, cette astuce est également utile si vous voulez décider dynamiquement (par exemple en fonction de la disponibilité des ressources) la classe de base à utiliser. Exemple::

source: How do I create static class data and static class methods?
fr: Comment puis-je créer des données statiques de classe et des méthodes statiques de classe?

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
fr: Tant les données statiques que les méthodes statiques (dans le sens de C + + ou Java) sont pris en charge en Python.

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
fr: Pour les données statiques, il suffit de définir un attribut de classe. Pour attribuer une nouvelle valeur à l'attribut, vous devez explicitement utiliser le nom de classe dans l'affectation:

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
fr: ``c.count`` se réfère également à ``C.count`` pour tout ``c`` telle que ``isInstance (c, C)`` est vrai, sauf remplacement par ``c`` lui-même ou par une classe sur le chemin de recherche de classe de base de ``c.__class__`` jusqu'à ``C``.

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
fr: Attention: dans une méthode de C, une affectation comme ``self.count=42`` crée une nouvelle instance et sans rapport avec le nom "count" dans dans le dictionnaire de données de ``self``. La redéfinition d'une donnée statique de classe doit toujours spécifier la classe que l'on soit à l'intérieur d'une méthode ou non:

source: Static methods are possible since Python 2.2::
fr: Les méthodes statiques sont possibles depuis Python 2.2::

source: With Python 2.4's decorators, this can also be written as ::
fr: Avec les décorateurs de Python 2.4, cela peut aussi s'écrire:

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
fr: Cependant, d'une manière beaucoup plus simple pour obtenir l'effet d'une méthode statique se fait par une simple fonction au niveau du module::

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
fr: Si votre code est structuré de manière à définir une classe (ou bien la hiérarchie des classes connexes) par module, ceci fournira l'encapsulation souhaitée.

source: How can I overload constructors (or methods) in Python?
fr: Comment puis-je surcharger les constructeurs (ou méthodes) en Python?

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
fr: Cette réponse s'applique en fait à toutes les méthodes, mais la question vient généralement en premier dans le contexte des constructeurs.

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
fr: En Python, vous devez écrire un constructeur unique qui considère tous les cas en utilisant des arguments par défaut. Par exemple::

source: This is not entirely equivalent, but close enough in practice.
fr: Ce n'est pas tout à fait équivalent, mais suffisamment proche dans la pratique.

source: You could also try a variable-length argument list, e.g. ::
fr: Vous pouvez aussi utiliser une liste d'arguments de longueur variable, par exemple ::

source: The same approach works for all method definitions.
fr: La même approche fonctionne pour toutes les définitions de méthode.

source: I try to use __spam and I get an error about _SomeClassName__spam.
fr: J'essaie d'utiliser __spam et j'obtiens une erreur à propos de _SomeClassName__spam.

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
fr: Les noms de variables avec le double de soulignement sont «déformés» pour fournir un moyen simple mais efficace de définir variables privées à la classe. Tout identificateur de la forme ``__spam`` (au moins deux traits de soulignement préfixe, au plus un soulignement suffix) est textuellement remplacé par ``_classname__spam``, où ``classname`` est le nom de la classe en cours avec les traits de soulignement dépouillés.

source: This doesn't guarantee privacy: an outside user can still deliberately access the "_classname__spam" attribute, and private values are visible in the object's ``__dict__``. Many Python programmers never bother to use private variable names at all.
fr: Cela ne garantit pas la privauté de l'accès : un utilisateur extérieur peut encore délibérément acceder à l'attribut ``_classname__spam``, et les valeurs privées sont visibles dans `` l'objet __dict__ ``. De nombreux programmeurs Python ne prennent jamais la peine d'utiliser des noms de variable privée.

source: My class defines __del__ but it is not called when I delete the object.
fr: Ma classe définit __del__ mais il n'est pas appelé lorsque je supprime l'objet.

source: There are several possible reasons for this.
fr: Il y a plusieurs raisons possibles pour cela.

source: The del statement does not necessarily call :meth:`__del__` -- it simply decrements the object's reference count, and if this reaches zero :meth:`__del__` is called.
fr: La commande del n'appelle pas forcément: meth: `__del__` - il décrémente simplement le compteur de références de l'objet, et si celui ci arrive à zéro: meth: `__del__` est appelée.
